import pandas as pd

data = {'itemId': [1, 3, 4, 2, 1, 4, 4, 3, 5, 1, 2, 5, 4, 3, 3, 4, 1, 2, 2, 1],
        'clientId': [21, 25, 18, 28, 20, 28, 21, 15, 28, 58, 56, 21, 78, 25, 21, 18, 45, 29, 17, 25],
        'timestamp': [33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33, 33]}

purchases = pd.DataFrame(data)

a = sorted(purchases['itemId'].tolist())

print(a)


# Кол-во товаров в списке?
# Что можно назвать популярным товаром?
# Как хранится информация о покупках?







































